Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91100.atdf
<?xml version="1.0"?>
<!--
 Copyright (c) 2021 Microchip Technology Inc.

 SPDX-License-Identifier: Apache-2.0

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<!--
CHPMKR VERSION: 2.4.0.dev
-->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="4.5" xsi:noNamespaceSchemaLocation="https://schemas.microchip.com/com/microchip/atdf/4.5/atdf.xsd">
  <file timestamp="2023-05-18T19:14:46Z"/>
  <variants xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
    <variant ordercode="PIC32CZ2051CA91100-I/BAD" mhc:ordercode="PIC32CZ2051CA91100-I/BAD" package="QFN100" pinout="PIC32CZCA100N" speedmax="300000000" tempmin="-40" tempmax="85" vccmin="1.66" vccmax="3.66"/>
    <variant ordercode="PIC32CZ2051CA91100-V/BAD" mhc:ordercode="PIC32CZ2051CA91100-V/BAD" package="QFN100" pinout="PIC32CZCA100N" speedmax="300000000" tempmin="-40" tempmax="105" vccmin="1.66" vccmax="3.66"/>
    <variant ordercode="PIC32CZ2051CA91100-E/BAD" mhc:ordercode="PIC32CZ2051CA91100-E/BAD" package="QFN100" pinout="PIC32CZCA100N" speedmax="200000000" tempmin="-40" tempmax="125" vccmin="1.66" vccmax="3.66"/>
    <variant ordercode="PIC32CZ2051CA91100-I/7YX" mhc:ordercode="PIC32CZ2051CA91100-I/7YX" package="TQFP100" pinout="PIC32CZCA100" speedmax="300000000" tempmin="-40" tempmax="85" vccmin="1.66" vccmax="3.66"/>
    <variant ordercode="PIC32CZ2051CA91100-V/7YX" mhc:ordercode="PIC32CZ2051CA91100-V/7YX" package="TQFP100" pinout="PIC32CZCA100" speedmax="300000000" tempmin="-40" tempmax="105" vccmin="1.66" vccmax="3.66"/>
    <variant ordercode="PIC32CZ2051CA91100-E/7YX" mhc:ordercode="PIC32CZ2051CA91100-E/7YX" package="TQFP100" pinout="PIC32CZCA100" speedmax="200000000" tempmin="-40" tempmax="125" vccmin="1.66" vccmax="3.66"/>
  </variants>
  <devices>
    <device name="PIC32CZ2051CA91100" architecture="CORTEX-M7" family="PIC32C" series="PIC32CZCA91">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="ITCM" start="0x00000000" size="0x20000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="PRM_ROM" start="0x4000000" size="0x8000" type="rom" rw="R" exec="true"/>
          <memory-segment name="FCR_BFM" start="0x8000000" size="0x20000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="FCR_CFM_USERCFG1" start="0xA000000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_USEROTP1" start="0xA001000" size="0x1000" type="user_signatures" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_BOOTCFG1" start="0xA002000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_DALCFG" start="0xA004000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_CALOTP" start="0xA007000" size="0x1000" type="other" pagesize="4096" rw="R"/>
          <memory-segment name="FCR_CFM_USERCFG2" start="0xA008000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_USEROTP2" start="0xA009000" size="0x1000" type="user_signatures" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_BOOTCFG2" start="0xA00A000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_HSMCFG0" start="0x0A00C000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_HSMCFG1" start="0x0A00D000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_HSMCFG2" start="0x0A00E000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_CFM_HSMCFG3" start="0x0A00F000" size="0x1000" type="flash" pagesize="4096" rw="RW"/>
          <memory-segment name="FCR_PFM" start="0xC000000" size="0x200000" type="flash" pagesize="4096" rw="RW" exec="true"/>
          <memory-segment name="DTCM" start="0x20000000" size="0x20000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="FLEXRAM" start="0x20020000" size="0x80000" type="ram" rw="RW" exec="true"/>
          <memory-segment name="APBA" start="0x44000000" size="0x800000" type="io" rw="RW"/>
          <memory-segment name="APBB" start="0x44800000" size="0x800000" type="io" rw="RW"/>
          <memory-segment name="APBC" start="0x45000000" size="0x800000" type="io" rw="RW"/>
          <memory-segment name="APBD" start="0x45800000" size="0x800000" type="io" rw="RW"/>
          <memory-segment name="APBE" start="0x46000000" size="0x800000" type="io" rw="RW"/>
          <memory-segment name="APBF" start="0x46800000" size="0x800000" type="io" rw="RW"/>
          <memory-segment name="SQI0_SFR" start="0x4F008000" size="0x1000" type="io" rw="RW"/>
          <memory-segment name="SQI1_SFR" start="0x4F009000" size="0x1000" type="io" rw="RW"/>
          <memory-segment name="USBHS0_SFR" start="0x4F010000" size="0x2000" type="io" rw="RW"/>
          <memory-segment name="USBHS1_SFR" start="0x4F012000" size="0x2000" type="io" rw="RW"/>
          <memory-segment name="HSM_SFR" start="0x4F018000" size="0x400" type="io" rw="RW"/>
          <memory-segment name="SQI0_XIP" start="0x80000000" size="0x10000000" type="ram" rw="RW" exec="true" external="true"/>
          <memory-segment name="SQI1_XIP" start="0x90000000" size="0x10000000" type="ram" rw="RW" exec="true" external="true"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x20000000" type="io" rw="RW"/>
          <memory-segment name="CM7H_ROM_TABLE" start="0xE00FE000" size="0x100" type="rom" rw="R" exec="true"/>
        </address-space>
      </address-spaces>
      <parameters>
        <param name="GCLK_ID_TRACE" value="63" caption="Index of Generic Clock"/>
        <param name="NUM_IRQ" value="222" caption="Number of Interrupt Requests"/>
        <param name="__CM7_REV" value="0x0101" caption="Cortex-M7 Revision"/>
        <param name="__DCACHE_PRESENT" value="1" caption="DCACHE present or not"/>
        <param name="__DEBUG_LVL" value="1" caption="Debug Level"/>
        <param name="__DTCM_PRESENT" value="1" caption="DTCM present or not"/>
        <param name="__ETM_LVL" value="1" caption="Extended Trace Level"/>
        <param name="__FPU_DP" value="1" caption="FPU double-precision or not"/>
        <param name="__FPU_PRESENT" value="1" caption="FPU present or not"/>
        <param name="__ICACHE_PRESENT" value="1" caption="ICACHE present or not"/>
        <param name="__ITCM_PRESENT" value="1" caption="ITCM present or not"/>
        <param name="__MPU_PRESENT" value="1" caption="MPU present or not"/>
        <param name="__MPU_REGIONS" value="8" caption="Number of MPU regions"/>
        <param name="__NVIC_PRIO_BITS" value="3" caption="Number of NVIC Priority bits"/>
        <param name="__TRACE_LVL" value="1" caption="Trace Level"/>
        <param name="__VTOR_PRESENT" value="1" caption="VTOR present or not"/>
        <param name="__Vendor_SysTickConfig" value="0" caption="Set to 1 if different SysTick Config is used"/>
        <param name="POWER_DOMAIN" value="PD_CORE_SW"/>
        <param name="__ARCH_ARM" value="1"/>
        <param name="__ARCH_ARM_CORTEX_M" value="1"/>
      </parameters>
      <peripherals>
        <module name="AC" id="03784" name2="cmp_ac_u2501_v2" version="2a0">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x46822000"/>
            <signals>
              <signal group="AIN" index="0" function="B" pad="PB01"/>
              <signal group="AIN" index="1" function="B" pad="PB00"/>
              <signal group="AIN" index="2" function="B" pad="PA20"/>
              <signal group="AIN" index="3" function="B" pad="PA19"/>
              <signal group="CMP" index="0" function="B" pad="PC07"/>
              <signal group="CMP" index="1" function="B" pad="PC06"/>
            </signals>
            <parameters>
              <param name="ATEST_IMPLEMENTED" value="1" caption="Defines if the ATEST register is implemented"/>
              <param name="ATEST_SIZE" value="2" caption="Defines the number of effective bits in ATEST register"/>
              <param name="DACVALUE_BIT" value="7" caption="Defines the number of bits in DACCTRLn.VALUE"/>
              <param name="GCLK_ID" value="42" caption="Index of Generic Clock"/>
              <param name="IO_INPUTS" value="4" caption="Defines the number of AC pair inputs connected to IO pins"/>
              <param name="PAIRS" value="1" caption="Defines the number of AC pairs"/>
              <param name="INSTANCE_ID" value="44" caption="Instance index for AC"/>
              <param name="MCLK_ID_APB" value="52" caption="Index for AC APB clock"/>
              <param name="PAC_ID" value="44" caption="Index for AC registers write protection"/>
              <param name="NUM_CMP" value="2" caption="Number of comparators"/>
              <param name="LOAD_CALIB" value="0" caption="Defines if calibration is required"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="03620" name2="adc_msh_ctrl_apb_v1" version="1a0">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x46820000"/>
            <signals>
              <signal group="VINM" index="16" function="B" pad="PA17"/>
              <signal group="VINM" index="18" function="B" pad="PA15"/>
              <signal group="VINM" index="24" function="B" pad="PA13"/>
              <signal group="VINM" index="26" function="B" pad="PA11"/>
              <signal group="VINM" index="32" function="B" pad="PA09"/>
              <signal group="VINM" index="34" function="B" pad="PA07"/>
              <signal group="VINP" index="0" function="B" pad="PB03"/>
              <signal group="VINP" index="1" function="B" pad="PB02"/>
              <signal group="VINP" index="2" function="B" pad="PB01"/>
              <signal group="VINP" index="3" function="B" pad="PB00"/>
              <signal group="VINP" index="4" function="B" pad="PA20"/>
              <signal group="VINP" index="5" function="B" pad="PA19"/>
              <signal group="VINP" index="16" function="B" pad="PA18"/>
              <signal group="VINP" index="17" function="B" pad="PA17"/>
              <signal group="VINP" index="18" function="B" pad="PA16"/>
              <signal group="VINP" index="19" function="B" pad="PA15"/>
              <signal group="VINP" index="24" function="B" pad="PA14"/>
              <signal group="VINP" index="25" function="B" pad="PA13"/>
              <signal group="VINP" index="26" function="B" pad="PA12"/>
              <signal group="VINP" index="27" function="B" pad="PA11"/>
              <signal group="VINP" index="32" function="B" pad="PA10"/>
              <signal group="VINP" index="33" function="B" pad="PA09"/>
              <signal group="VINP" index="34" function="B" pad="PA08"/>
              <signal group="VINP" index="35" function="B" pad="PA07"/>
            </signals>
            <parameters>
              <param name="APB_FIFO_DEPTH" value="16" caption="Number of Words in APB FIFO"/>
              <param name="CHNSAR_NMBR1" value="16" caption="Number of Channels on SARCORE number 1"/>
              <param name="CHNSAR_NMBR2" value="7" caption="Number of Channels on SARCORE number 2"/>
              <param name="CHNSAR_NMBR3" value="7" caption="Number of Channels on SARCORE number 3"/>
              <param name="CHNSAR_NMBR4" value="7" caption="Number of Channels on SARCORE number 4"/>
              <param name="DCMP_NMBR" value="4" caption="Number of Digital Comparators Max=4"/>
              <param name="DMAC_ID_PFFRDY" value="75"/>
              <param name="EARLY_INTR_PRESENT" value="1" caption="Early Interrupts Present"/>
              <param name="FLTR_NMBR" value="4" caption="Number of Digital Filters, Max=0"/>
              <param name="GCLK_ID" value="41" caption="Index of Generic Clock"/>
              <param name="OCP_ADDR_WIDTH" value="16" caption="OCP Address Width"/>
              <param name="OCP_FIFO_DEPTH" value="16" caption="Number of Words in OCP DMA FIFO"/>
              <param name="OCP_PORT_PRESENT" value="0" caption="OCP DMA Bus Master Present"/>
              <param name="SARCORE_NMBR" value="4" caption="Number of SARCOREs. Max=4, Min-1"/>
              <param name="TRGS_NMBR" value="16" caption="Number of Trigger Sources, Max=16"/>
              <param name="VREF_STARTUP_TIME" value="50" caption="Number of Control Clock cycles for VREF to stabalize"/>
              <param name="INSTANCE_ID" value="43" caption="Instance index for ADC"/>
              <param name="MCLK_ID_APB" value="51" caption="Index for ADC APB clock"/>
              <param name="PAC_ID" value="43" caption="Index for ADC registers write protection"/>
            </parameters>
          </instance>
        </module>
