Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91100.atdf
        <module name="BSDAP" id="04702" name2="jtag_bs_dap_sib_v1" version="1a0">
          <instance name="BSDAP">
            <signals>
              <signal group="TCK_SWCLK" function="G" pad="PC20" ioset="1"/>
              <signal group="TDI" function="G" pad="PC17" ioset="1"/>
              <signal group="TDO" function="G" pad="PC19" ioset="1"/>
              <signal group="TMS_SWDIO" function="G" pad="PC18" ioset="1"/>
            </signals>
            <parameters>
              <param name="MCLK_ID_DAP" value="80" caption="Index for BSDAP DAP clock"/>
            </parameters>
          </instance>
        </module>
        <module name="CAN" id="03723" name2="can_fd_u2003_v4" version="4a0">
          <instance name="CAN0">
            <register-group name="CAN0" name-in-module="CAN" address-space="base" offset="0x45060000"/>
            <signals>
              <signal group="RX" function="H" pad="PC04" ioset="1"/>
              <signal group="RX" function="H" pad="PC19" ioset="2"/>
              <signal group="TX" function="H" pad="PC05" ioset="1"/>
              <signal group="TX" function="H" pad="PC20" ioset="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="83" caption="DMA CAN Debug Req"/>
              <param name="ECC_BERR_IMPLEMENTED" value="0" caption="ECC error"/>
              <param name="EXT_TSTAMP_IMPLEMENTED" value="0" caption="External time stamp"/>
              <param name="GCLK_ID" value="46" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x20" caption="8-bits MSB"/>
              <param name="RXD_SYNC_METHOD" value="0" caption="RXD Synchronization Method"/>
              <param name="INSTANCE_ID" value="48" caption="Instance index for CAN0"/>
              <param name="MCLK_ID_AHB" value="56" caption="Index for CAN0 AHB clock"/>
              <param name="PAC_ID" value="48" caption="Index for CAN0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="CAN1">
            <register-group name="CAN1" name-in-module="CAN" address-space="base" offset="0x46060000"/>
            <signals>
              <signal group="RX" function="H" pad="PC06" ioset="1"/>
              <signal group="RX" function="H" pad="PD08" ioset="2"/>
              <signal group="TX" function="H" pad="PC07" ioset="1"/>
              <signal group="TX" function="H" pad="PD09" ioset="2"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_DEBUG" value="84" caption="DMA CAN Debug Req"/>
              <param name="ECC_BERR_IMPLEMENTED" value="0" caption="ECC error"/>
              <param name="EXT_TSTAMP_IMPLEMENTED" value="0" caption="External time stamp"/>
              <param name="GCLK_ID" value="47" caption="Index of Generic Clock"/>
              <param name="MSG_RAM_ADDR" value="0x20" caption="8-bits MSB"/>
              <param name="RXD_SYNC_METHOD" value="0" caption="RXD Synchronization Method"/>
              <param name="INSTANCE_ID" value="49" caption="Instance index for CAN1"/>
              <param name="MCLK_ID_AHB" value="57" caption="Index for CAN1 AHB clock"/>
              <param name="PAC_ID" value="49" caption="Index for CAN1 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" id="SYSTEM_IP" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000ED00"/>
          </instance>
        </module>
        <module name="DMA" id="03639" name2="dma_axi_apb_v1" version="1a0">
          <instance name="DMA">
            <register-group name="DMA" name-in-module="DMA" address-space="base" offset="0x44850000"/>
            <parameters>
              <param name="DMAC_ID_EVSYS" value="1" caption="Events trigger index"/>
              <param name="DMAC_ID_SWTRG" value="0" caption="Software trigger index"/>
              <param name="INSTANCE_ID" value="19" caption="Instance index for DMA"/>
              <param name="MCLK_ID_APB" value="25" caption="Index for DMA APB clock"/>
              <param name="MCLK_ID_AXI" value="24" caption="Index for DMA AXI clock"/>
              <param name="PAC_ID" value="19" caption="Index for DMA registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DRMTCM" id="03770" name2="drm_tcm_ecc_v1" version="1a0">
          <instance name="DRMTCM">
            <register-group name="DRMTCM" name-in-module="DRMTCM" address-space="base" offset="0x44820000"/>
            <parameters>
              <param name="DPTRMSB" value="5"/>
              <param name="DTCMADDR_MSB" value="16"/>
              <param name="DTCMPAR" value="7"/>
              <param name="IPTRMSB" value="6"/>
              <param name="ITCMADDR_MSB" value="16"/>
              <param name="ITCMPAR" value="8"/>
              <param name="NO_ECC" value="0"/>
              <param name="INSTANCE_ID" value="15" caption="Instance index for DRMTCM"/>
              <param name="MCLK_ID_APB" value="19" caption="Index for DRMTCM APB clock"/>
              <param name="PAC_ID" value="15" caption="Index for DRMTCM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="03716" name2="icd_dsu_u2810_v2" version="2a0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x44000000"/>
            <signals>
              <signal group="PMSA" index="0" function="dsu_pmsa0" pad="PA14"/>
              <signal group="PMSA" index="1" function="dsu_pmsa0" pad="PA12"/>
              <signal group="PMSA" index="2" function="dsu_pmsa0" pad="PA11"/>
              <signal group="PMSA" index="3" function="dsu_pmsa0" pad="PA09"/>
              <signal group="PMSA" index="4" function="dsu_pmsa0" pad="PA07"/>
              <signal group="PMSA" index="5" function="dsu_pmsa0" pad="PA06"/>
              <signal group="PMSA" index="6" function="dsu_pmsa0" pad="PA04"/>
              <signal group="PMSA" index="7" function="dsu_pmsa0" pad="PA02"/>
            </signals>
            <parameters>
              <param name="BMX_ERROR_SUPPORT" value="1" caption="Defines whether DSU APB errors are reported as 2-cycles bus errors to the AHB AP0 master"/>
              <param name="DAL1_IMPLEMENTED" value="0" caption="Debug Access Level 1 (Non-Secure) Implemented? for TZ devices only"/>
              <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
              <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for DSU"/>
              <param name="MCLK_ID_AHB" value="0" caption="Index for DSU AHB clock"/>
              <param name="MCLK_ID_APB" value="1" caption="Index for DSU APB clock"/>
              <param name="PAC_ID" value="0" caption="Index for DSU registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DWT" id="SYSTEM_IP" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
