Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91100.atdf
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x50" size="0x50" count="16"/>
      </register-group>
      <register-group name="DMA_DESCRIPTOR" caption="Direct Memory Access Controller" section="flexram" aligned="4">
        <register name="BDNXT" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="NEXT BUFFER DESCRIPTOR ADDRESS POINTER">
          <bitfield name="NXT" caption="Next Descriptor Pointer" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDCFG" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR CONFIGURATION">
          <bitfield name="CTRLB" caption="CTRLB Register Descriptor Load" mask="0x1"/>
          <bitfield name="EVCTRL" caption="EVCTRL Register Descriptor Load" mask="0x2"/>
          <bitfield name="SSA" caption="SSA Register Descriptor Load" mask="0x4"/>
          <bitfield name="DSA" caption="DSA Register Descriptor Load" mask="0x8"/>
          <bitfield name="SSTRD" caption="SSTRD Register Descriptor Load" mask="0x10"/>
          <bitfield name="DSTRD" caption="DSTRD Register Descriptor Load" mask="0x20"/>
          <bitfield name="XSIZ" caption="XSIZ Register Descriptor Load" mask="0x40"/>
          <bitfield name="PDAT" caption="PDAT Register Descriptor Load" mask="0x80"/>
          <bitfield name="CTRLCRC" caption="CTRLCRC Register Descriptor Load" mask="0x100"/>
          <bitfield name="CRCDAT" caption="CRCDAT Register Descriptor Load" mask="0x200"/>
          <bitfield name="ENABLE" caption="Channel Enable" mask="0x1000000"/>
          <bitfield name="LLEN" caption="Linked List Enable" mask="0x2000000"/>
          <bitfield name="SWFRC" caption="Software Forced Trigger" mask="0x4000000"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x8000000"/>
        </register>
        <register name="BDCTRLB" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR CONTROL REGISTER B">
          <bitfield name="WAS" caption="Channel Write Address Sequence." mask="0x7" values="BDCTRLB__WAS"/>
          <bitfield name="RAS" caption="Channel Read Address Sequence" mask="0x70" values="BDCTRLB__RAS"/>
          <bitfield name="PRI" caption="Channel Priority level." mask="0x300" values="BDCTRLB__PRI"/>
          <bitfield name="WBOEN" caption="Write Byte Order Enable" mask="0x2000"/>
          <bitfield name="BYTORD" caption="Byte Order" mask="0xC000" values="BDCTRLB__BYTORD"/>
          <bitfield name="TRIG" caption="Trigger that can Start a Channel Transfer" mask="0xFF0000"/>
          <bitfield name="PIGNEN" caption="Enable Pattern Ignore Byte" mask="0x1000000"/>
          <bitfield name="PATLEN" caption="Pattern Match Length" mask="0x2000000"/>
          <bitfield name="PATEN" caption="Channel Pattern Match Abort Enable." mask="0x4000000"/>
          <bitfield name="CASTEN" caption="Cell Auto Start Enable of Ensuing Transfers for this channel" mask="0x20000000"/>
          <bitfield name="CRCEN" caption="CRC Enable bit" mask="0x80000000"/>
        </register>
        <register name="BDEVCTRL" offset="0xC" rw="RW" size="2" initval="0x0000" caption="CURRENT BUFFER DESCRIPTOR EVENT CONTROL">
          <bitfield name="EVAUXACT" caption="Channel Auxiliary Event Input Action" mask="0x3" values="BDEVCTRL__EVAUXACT"/>
          <bitfield name="EVOMODE" caption="Channel Event Output Mode" mask="0xC" values="BDEVCTRL__EVOMODE"/>
          <bitfield name="EVAUXIE" caption="Channel Auxiliary Event Enable (0: disable; 1: enable)" mask="0x20"/>
          <bitfield name="EVSTRIE" caption="Channel Start Event Input Enable (0: disable; 1:enable)" mask="0x40"/>
          <bitfield name="EVOE" caption="Channel Event Output Enable (0: disable; 1: enable)" mask="0x80"/>
        </register>
        <register name="BDCTRLCRC" offset="0xE" rw="RW" size="2" initval="0x0000" caption="CURRENT BUFFER DESCRIPTOR CRC CONTROL">
          <bitfield name="CRCMD" caption="CRC/Checksum Mode" mask="0x7" values="BDCTRLCRC__CRCMD"/>
          <bitfield name="CRCAPP" caption="CRC Append Mode" mask="0x8"/>
          <bitfield name="CRCXOR" caption="CRC XOR Mode" mask="0x20"/>
          <bitfield name="CRCROUT" caption="CRC Reflected Output Mode" mask="0x40"/>
          <bitfield name="CRCRIN" caption="CRC Reflect Input Selection" mask="0x80"/>
        </register>
        <register name="BDSSA" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR SOURCE START ADDRESS">
          <bitfield name="SSA" caption="Source Start Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDDSA" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR DESTINATION START ADDRESS">
          <bitfield name="DSA" caption="Destination Start Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDSSTRD" offset="0x18" rw="RW" size="2" initval="0x0000" caption="CURRENT BUFFER DESCRIPTOR SOURCE CELL STRIDE">
          <bitfield name="SSTRD" caption="Source Stride Size" mask="0xFFFF"/>
        </register>
        <register name="BDDSTRD" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="CURRENT BUFFER DESCRIPTOR DESTINATION CELL STRIDE">
          <bitfield name="DSTRD" caption="Destination Stride Size" mask="0xFFFF"/>
        </register>
        <register name="BDXSIZ" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR TRANSFER SIZE">
          <bitfield name="CSZ" caption="Cell transfer size in bytes." mask="0x3FF"/>
          <bitfield name="BLKSZ" caption="Block transfer size in bytes." mask="0xFFFF0000"/>
        </register>
        <register name="BDPDAT" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR PATTERN MATCH DATA">
          <bitfield name="PDAT" caption="Channel Pattern Match Data" mask="0xFFFF"/>
          <bitfield name="PIGN" caption="Channel Pattern Ignore Value" mask="0xFF000000"/>
        </register>
        <register name="BDCRCDAT" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR CRC/CHECKSUM DATA">
          <bitfield name="CRCDAT" caption="CRC/Checksum Data Register" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CHCTRLB__WAS">
        <value name="BYTE_ADDR_INCR" caption="Incrementing Address+1 with Transfers of Byte Operands" value="0"/>
        <value name="HALF_WORD_ADDR_INCR" caption="Incrementing Address+2 with Transfers of HalfWord Operands" value="1"/>
        <value name="AUTO_ADDR_INCR" caption="Auto Increment Address and Transfer Size" value="2"/>
        <value name="FIXED_BYTE_ADDR_INCR" caption="Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)" value="3"/>
        <value name="FIXED_HALF_WORD_ADDR_INCR" caption="Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)" value="4"/>
        <value name="FIXED_WORD_ADDR_INCR" caption="Fixed Address Word Burst Transfer" value="5"/>
      </value-group>
      <value-group name="CHCTRLB__RAS">
        <value name="BYTE_ADDR_INCR" caption="Incrementing Address+1 with Transfers of Byte Operands" value="0"/>
        <value name="HALF_WORD_ADDR_INCR" caption="Incrementing Address+2 with Transfers of HalfWord Operands" value="1"/>
        <value name="AUTO_ADDR_INCR" caption="Auto Increment Address and Transfer Size" value="2"/>
        <value name="FIXED_BYTE_ADDR_INCR" caption="Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)" value="3"/>
        <value name="FIXED_HALF_WORD_ADDR_INCR" caption="Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)" value="4"/>
        <value name="FIXED_WORD_ADDR_INCR" caption="Fixed Address Word Burst Transfer" value="5"/>
      </value-group>
      <value-group name="CHCTRLB__PRI">
        <value name="PRI_1" caption="Channel Priority is 1" value="0"/>
        <value name="PRI_2" caption="Channel Priority is 2" value="1"/>
        <value name="PRI_3" caption="Channel Priority is 3" value="2"/>
        <value name="PRI_4" caption="Channel Priority is 4 (HIGHEST)" value="3"/>
      </value-group>
      <value-group name="CHCTRLB__BYTORD">
        <value name="BYTORD_NONE" caption="Bytes are processed AS IS" value="0"/>
        <value name="BYTORD_WORD_SWIZZLE" caption="Bytes are swapped as: BYTE3 to BYTE0, BYTE2 to BYTE1, BYTE1 to BYTE2, and BYTE0 to BYTE3" value="1"/>
        <value name="BYTORD_HALF_WORD_SWIZZLE" caption="Bytes are swapped as: BYTE3 to BYTE1, BYTE2 to BYTE0, BYTE1 to BYTE3, and BYTE0 to BYTE2" value="2"/>
        <value name="BYTORD_BYTE_SWIZZLE" caption="Bytes are swapped as: BYTE3 to BYTE2, BYTE2 to BYTE3, BYTE1 to BYTE1, and BYTE0 to BYTE1" value="3"/>
      </value-group>
