Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91100.atdf
        <register name="CBSCTRL" offset="0x14BC" rw="RW" size="4" initval="0x00000000" caption="CBS Control Register">
          <bitfield name="CBSEQA" caption="Enable Credit-Based shaping on the highest priority queue (queue A)" mask="0x1"/>
          <bitfield name="CBSEQB" caption="Enable Credit-Based shaping on the 2nd highest priority queue (queue B)" mask="0x2"/>
        </register>
        <register name="CBSISQA" offset="0x14C0" rw="RW" size="4" initval="0x00000000" caption="IdleSlope value for queue A">
          <bitfield name="ISA" caption="IdleSlope value for queue A" mask="0xFFFFFFFF"/>
        </register>
        <register name="CBSISQB" offset="0x14C4" rw="RW" size="4" initval="0x00000000" caption="IdleSlope value for queue B">
          <bitfield name="ISA" caption="IdleSlope value for queue A" mask="0xFFFFFFFF"/>
        </register>
        <register name="UTXQBA" offset="0x14C8" rw="RW" size="4" initval="0x00000000" caption="Upper 32 bits of transmit buffer descriptor queue base address">
          <bitfield name="UTXQBA" caption="Upper 32 bits of transmit buffer descriptor queue base address" mask="0xFFFFFFFF"/>
        </register>
        <register name="TXBDCTRL" offset="0x14CC" rw="RW" size="4" initval="0x00000000" caption="TX BD control register">
          <bitfield name="TXBDTSM" caption="TX Descriptor Timestamp Insertion mode" mask="0x30"/>
        </register>
        <register name="RXBDCTRL" offset="0x14D0" rw="RW" size="4" initval="0x00000000" caption="RX BD control register">
          <bitfield name="RXBDTSM" caption="RX Descriptor Timestamp Insertion mode" mask="0x30"/>
        </register>
        <register name="URXQBA" offset="0x14D4" rw="RW" size="4" initval="0x00000000" caption="Upper 32 bits of receive buffer descriptor queue base address">
          <bitfield name="URXQBA" caption="Upper 32 bits of receive buffer descriptor queue base address" mask="0xFFFFFFFF"/>
        </register>
        <register name="SCRT1" offset="0x1500" rw="RW" size="4" count="16" initval="0x00000000" caption="Screening Type 1 Register N">
          <bitfield name="QNMBR" caption="Queue Number" mask="0xF"/>
          <bitfield name="DSTCM" caption="DS/TC Match" mask="0xFF0"/>
          <bitfield name="UDPP" caption="UDP Port Match" mask="0xFFFF000"/>
          <bitfield name="DSTCE" caption="DS/TC Enable" mask="0x10000000"/>
          <bitfield name="UDPE" caption="UDP Port Match Enable" mask="0x20000000"/>
        </register>
        <register name="SCRT2" offset="0x1540" rw="RW" size="4" count="16" initval="0x00000000" caption="Screening Type 2 Register">
          <bitfield name="QNMBR" caption="Queue Number" mask="0xF"/>
          <bitfield name="VLANPRI" caption="VLAN Priority" mask="0x70"/>
          <bitfield name="VLANE" caption="VLAN Enable" mask="0x100"/>
          <bitfield name="ETID" caption="EtherType Index" mask="0xE00"/>
          <bitfield name="ETE" caption="EtherType Enable" mask="0x1000"/>
          <bitfield name="CMPAID" caption="Compare A Index" mask="0x3E000"/>
          <bitfield name="CMPAE" caption="Compare A Enable" mask="0x40000"/>
          <bitfield name="CMPBID" caption="Compare B Index" mask="0xF80000"/>
          <bitfield name="CMPBE" caption="Compare B Enable" mask="0x1000000"/>
          <bitfield name="CMPCID" caption="Compare C Index" mask="0x3E000000"/>
          <bitfield name="CMPCE" caption="Compare C Enable" mask="0x40000000"/>
        </register>
        <register name="RXQPTR" offset="0x15C0" rw="RW" size="4" count="8" initval="0x00000000" caption="Receive buffer queue base address">
          <bitfield name="DMARXQPTR" caption="Receive buffer queue base address" mask="0xFFFFFFFC"/>
        </register>
        <register name="DMARXQS" offset="0x15E0" rw="RW" size="4" count="8" initval="0x00000000" caption="Receive Buffer Queue Size">
          <bitfield name="DMARXQS" caption="Receive Buffer Queue Size" mask="0xFF"/>
        </register>
        <register name="IERQ" offset="0x1600" rw="RW" size="4" atomic-op="set:IMRQ" count="7" initval="0x00000000" caption="Interrupt Enable Queue N">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IDRQ" offset="0x1620" rw="RW" size="4" atomic-op="clear:IMRQ" count="7" initval="0x00000000" caption="Interrupt Disable Queue N">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IMRQ" offset="0x1640" rw="RW" size="4" count="7" initval="0x00000876" caption="Interrupt Mask  Queue Register">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IERQU" offset="0x1660" rw="RW" size="4" atomic-op="set:IMRQ" count="8" initval="0x00000000" caption="Interrupt Enable Queue N (upper)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IDRQU" offset="0x1680" rw="RW" size="4" atomic-op="clear:IMRQ" count="8" initval="0x00000000" caption="Interrupt Disable Queue N (upper)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="IMRQU" offset="0x16A0" rw="RW" size="4" count="8" initval="0x00000876" caption="Interrupt Mask Queue N (upper)">
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
        </register>
        <register name="SCRT2ET" offset="0x16E0" rw="RW" size="4" count="8" initval="0x00000000" caption="Screening Type 2 EtherType Register">
          <bitfield name="CMPVAL" caption="Ethertype compare value" mask="0xFFFF"/>
        </register>
        <register-group name="SCRT2CMP" name-in-module="SCRT2CMP" offset="0x1700" size="0x8" count="32"/>
      </register-group>
    </module>
    <module name="ETM" id="SYSTEM_IP" version="1.0.0" caption="Embedded Trace Macrocell">
      <register-group name="ETM" caption="Embedded Trace Macrocell">
        <register name="CR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000411" caption="ETM Main Control Register">
          <bitfield name="ETMPD" caption="ETM Power Down" mask="0x1"/>
          <bitfield name="PORTSIZE" caption="Port Size bits 2:0" mask="0x70"/>
          <bitfield name="STALL" caption="Stall Processor" mask="0x80"/>
          <bitfield name="BROUT" caption="Branch Output" mask="0x100"/>
          <bitfield name="DBGRQ" caption="Debug Request Control" mask="0x200"/>
          <bitfield name="PROG" caption="ETM Programming" mask="0x400"/>
          <bitfield name="PORTSEL" caption="ETM Port Select" mask="0x800"/>
          <bitfield name="PORTMODE2" caption="Port Mode bit 2" mask="0x2000"/>
          <bitfield name="PORTMODE" caption="Port Mode bits 1:0" mask="0x30000"/>
          <bitfield name="PORTSIZE3" caption="Port Size bit 3" mask="0x200000"/>
          <bitfield name="TSEN" caption="TimeStamp Enable" mask="0x10000000"/>
        </register>
        <register name="CCR" offset="0x4" rw="R" size="4" access-size="4" initval="0x8C802000" caption="ETM Configuration Code Register">
        </register>
        <register name="TRIGGER" offset="0x8" rw="RW" size="4" access-size="4" caption="ETM Trigger Event Register">
        </register>
        <register name="SR" offset="0x10" rw="RW" size="4" access-size="4" caption="ETM Status Register">
        </register>
        <register name="SCR" offset="0x14" rw="R" size="4" access-size="4" atomic-op="clear:SR" initval="0x00020D09" caption="ETM System Configuration Register">
        </register>
        <register name="TEEVR" offset="0x20" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Event Register">
        </register>
        <register name="TECR1" offset="0x24" rw="RW" size="4" access-size="4" caption="ETM TraceEnable Control 1 Register">
        </register>
