Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA91_DFP/1.0.11/atdf/PIC32CZ2051CA91100.atdf
      <value-group name="RPMU_VREGCTRL__AVREGSTDBY">
        <value name="OFFINSTDBY" caption="Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well." value="0x0"/>
        <value name="ONINSTDBY" caption="Regulator is ON in Standby mode if AVREGEN bit is set. is OFF from Hibernate mode. It is OFF in backup mode as well." value="0x1"/>
      </value-group>
      <value-group name="PLL0_CTRL__REFSEL">
        <value name="GCLK" caption="Dedicated GCLK clock reference" value="0x0"/>
        <value name="XOSC" caption="XOSC clock reference" value="0x1"/>
        <value name="DFLL48M" caption="DFLL48M clock reference" value="0x2"/>
      </value-group>
      <value-group name="PLL0_CTRL__BWSEL">
        <value name="BWSEL0" caption="TBD" value="0x0"/>
        <value name="BWSEL1" caption="TBD" value="0x1"/>
        <value name="BWSEL2" caption="TBD" value="0x2"/>
        <value name="BWSEL3" caption="TBD" value="0x3"/>
        <value name="BWSEL4" caption="TBD" value="0x4"/>
        <value name="BWSEL5" caption="TBD" value="0x5"/>
        <value name="BWSEL6" caption="TBD" value="0x6"/>
        <value name="BWSEL7" caption="TBD" value="0x7"/>
      </value-group>
      <value-group name="DAL__CPU0">
        <value name="DAL0" caption="FCW_DAL0_VALUE" value="0x81"/>
        <value name="DAL1" caption="FCW_DAL1_VALUE" value="0x99"/>
        <value name="DAL2" caption="FCW_DAL2_VALUE" value="0xDB"/>
      </value-group>
      <value-group name="DAL__CPU1">
        <value name="DAL0" caption="" value="0x81"/>
        <value name="DAL1" caption="" value="0x99"/>
        <value name="DAL2" caption="" value="0xDB"/>
      </value-group>
    </module>
    <module name="GCLK" id="03726" name2="clk_gclk_u2122_v1" version="1d0" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bit" mask="0x4"/>
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bit" mask="0x8"/>
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bit" mask="0x10"/>
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bit" mask="0x20"/>
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bit" mask="0x40"/>
          <bitfield name="GENCTRL5" caption="Generic Clock Generator Control 5 Synchronization Busy bit" mask="0x80"/>
          <bitfield name="GENCTRL6" caption="Generic Clock Generator Control 6 Synchronization Busy bit" mask="0x100"/>
          <bitfield name="GENCTRL7" caption="Generic Clock Generator Control 7 Synchronization Busy bit" mask="0x200"/>
          <bitfield name="GENCTRL8" caption="Generic Clock Generator Control 8 Synchronization Busy bit" mask="0x400"/>
          <bitfield name="GENCTRL9" caption="Generic Clock Generator Control 9 Synchronization Busy bit" mask="0x800"/>
          <bitfield name="GENCTRL10" caption="Generic Clock Generator Control 10 Synchronization Busy bit" mask="0x1000"/>
          <bitfield name="GENCTRL11" caption="Generic Clock Generator Control 11 Synchronization Busy bit" mask="0x2000"/>
          <bitfield name="GENCTRL12" caption="Generic Clock Generator Control 12 Synchronization Busy bit" mask="0x4000"/>
          <bitfield name="GENCTRL13" caption="Generic Clock Generator Control 13 Synchronization Busy bit" mask="0x8000"/>
          <bitfield name="GENCTRL14" caption="Generic Clock Generator Control 14 Synchronization Busy bit" mask="0x10000"/>
          <bitfield name="GENCTRL15" caption="Generic Clock Generator Control 15 Synchronization Busy bit" mask="0x20000"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" access="WSYNC" size="4" count="16" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0xF" values="GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="64" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0xF" values="PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GENCTRL__SRC">
        <value name="XOSC" caption="XOSC0 oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="4"/>
        <value name="DFLL" caption="DFLL output" value="5"/>
        <value name="PLL0_1" caption="PLL0 output 1" value="6"/>
        <value name="PLL0_2" caption="PLL0 output 2" value="7"/>
        <value name="PLL0_3" caption="PLL0 output 3" value="8"/>
        <value name="PLL0_4" caption="PLL0 output 4" value="9"/>
        <value name="PLL1_1" caption="Frac Divider PLL1 output 1" value="10"/>
        <value name="PLL1_2" caption="Frac Divider PLL1 output 2" value="11"/>
        <value name="PLL1_3" caption="PLL1 output 3" value="12"/>
        <value name="PLL1_4" caption="PLL1 output 4" value="13"/>
      </value-group>
      <value-group name="GENCTRL__DIVSEL">
        <value name="DIV1" caption="Divide input directly by divider factor" value="0x0"/>
        <value name="DIV2" caption="Divide input by 2^(divider factor+ 1)" value="0x1"/>
      </value-group>
      <value-group name="PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x8"/>
        <value name="GCLK9" caption="Generic clock generator 9" value="0x9"/>
        <value name="GCLK10" caption="Generic clock generator 10" value="0xA"/>
        <value name="GCLK11" caption="Generic clock generator 11" value="0xB"/>
        <value name="GCLK12" caption="Generic clock generator 12" value="0xC"/>
        <value name="GCLK13" caption="Generic clock generator 13" value="0xD"/>
        <value name="GCLK14" caption="Generic clock generator 14" value="0xE"/>
        <value name="GCLK15" caption="Generic clock generator 15" value="0xF"/>
      </value-group>
    </module>
